'use strict';

/**
 * List of languages supported by "translate" action.
 */

exports['name-to-code'] = {
  // Source:
  // https://tech.yandex.ru/translate/doc/dg/concepts/api-overview-docpage/#languages

  'азербайджанский': 'az',
  'албанский':       'sq',
  'амхарский':       'am',
  'английский':      'en',
  'арабский':        'ar',
  'армянский':       'hy',
  'африкаанс':       'af',
  'баскский':        'eu',
  'башкирский':      'ba',
  'белорусский':     'be',
  'бенгальский':     'bn',
  'бирманский':      'my',
  'болгарский':      'bg',
  'боснийский':      'bs',
  'валлийский':      'cy',
  'венгерский':      'hu',
  'вьетнамский':     'vi',

  // Unsupported by Dialogflow
  //'гаитянский':	     'ht',
  //'креольский':      'ht',

  'галисийский':     'gl',
  'голландский':     'nl',
  'горномарийский':  'mrj',
  'греческий':       'el',
  'грузинский':      'ka',
  'гуджарати':       'gu',
  'датский':         'da',
  'иврит':           'he',
  'идиш':            'yi',
  'индонезийский':   'id',
  'ирландский':      'ga',
  'итальянский':     'it',
  'исландский':      'is',
  'испанский':       'es',
  'казахский':       'kk',
  'каннада':         'kn',
  'каталанский':     'ca',
  'киргизский':      'ky',
  'китайский':       'zh',
  'корейский':       'ko',

  // Unsupported by Dialogflow
  //'коса':            'xh',

  'кхмерский':       'km',
  'лаосский':        'lo',

  // Unsupported by Dialogflow
  //'латынь':          'la',

  'латышский':       'lv',
  'литовский':       'lt',
  'люксембургский':  'lb',
  'малагасийский':   'mg',
  'малайский':       'ms',
  'малаялам':        'ml',
  'мальтийский':     'mt',
  'македонский':     'mk',
  'маори':           'mi',
  'маратхи':         'mr',
  'марийский':       'mhr',
  'монгольский':     'mn',
  'немецкий':        'de',
  'непальский':      'ne',
  'норвежский':      'no',
  'панджаби':        'pa',

  // Unsupported by Dialogflow
  //'папьяменто':      'pap',

  'персидский':      'fa',
  'польский':        'pl',
  'португальский':   'pt',
  'румынский':       'ro',
  'русский':         'ru',

  // Unsupported by Dialogflow
  //'себуанский':      'ceb',

  'сербский':        'sr',
  'сингальский':     'si',
  'словацкий':       'sk',
  'словенский':      'sl',
  'суахили':         'sw',
  'сунданский':      'su',
  'таджикский':      'tg',
  'тайский':         'th',
  'тагальский':      'tl',
  'тамильский':      'ta',
  'татарский':       'tt',
  'телугу':          'te',
  'турецкий':        'tr',
  'удмуртский':      'udm',
  'узбекский':       'uz',
  'украинский':      'uk',
  'урду':            'ur',
  'финский':         'fi',
  'французский':     'fr',
  'хинди':           'hi',
  'хорватский':      'hr',
  'чешский':         'cs',
  'шведский':        'sv',

  // Unsupported by Dialogflow
  //'шотландский':     'gd',

  'эстонский':       'et',
  'эсперанто':       'eo',
  'яванский':        'jv',
  'японский':        'ja'
}

exports['code-to-name'] = {

  'az': 'азербайджанский',
  'sq': 'албанский',
  'am': 'амхарский',
  'en': 'английский',
  'ar': 'арабский',
  'hy': 'армянский',
  'af': 'африкаанс',
  'eu': 'баскский',
  'ba': 'башкирский',
  'be': 'белорусский',
  'bn': 'бенгальский',
  'my': 'бирманский',
  'bg': 'болгарский',
  'bs': 'боснийский',
  'cy': 'валлийский',
  'hu': 'венгерский',
  'vi': 'вьетнамский',

  // Unsupported by Dialogflow
  //'ht':	'гаитянский',
  //'ht': 'креольский',

  'gl':  'галисийский',
  'nl':  'голландский',
  'mrj': 'горномарийский',
  'el':  'греческий',
  'ka':  'грузинский',
  'gu':  'гуджарати',
  'da':  'датский',
  'he':  'иврит',
  'yi':  'идиш',
  'id':  'индонезийский',
  'ga':  'ирландский',
  'it':  'итальянский',
  'is':  'исландский',
  'es':  'испанский',
  'kk':  'казахский',
  'kn':  'каннада',
  'ca':  'каталанский',
  'ky':  'киргизский',
  'zh':  'китайский',
  'ko':  'корейский',

  // Unsupported by Dialogflow
  //'xh': 'коса',

  'km': 'кхмерский',
  'lo': 'лаосский',

  // Unsupported by Dialogflow
  //'la': 'латынь',

  'lv':  'латышский',
  'lt':  'литовский',
  'lb':  'люксембургский',
  'mg':  'малагасийский',
  'ms':  'малайский',
  'ml':  'малаялам',
  'mt':  'мальтийский',
  'mk':  'македонский',
  'mi':  'маори',
  'mr':  'маратхи',
  'mhr': 'марийский',
  'mn':  'монгольский',
  'de':  'немецкий',
  'ne':  'непальский',
  'no':  'норвежский',
  'pa':  'панджаби',

  // Unsupported by Dialogflow
  //'pap': 'папьяменто',

  'fa': 'персидский',
  'pl': 'польский',
  'pt': 'португальский',
  'ro': 'румынский',
  'ru': 'русский',

  // Unsupported by Dialogflow
  //'ceb': 'себуанский',

  'sr':  'сербский',
  'si':  'сингальский',
  'sk':  'словацкий',
  'sl':  'словенский',
  'sw':  'суахили',
  'su':  'сунданский',
  'tg':  'таджикский',
  'th':  'тайский',
  'tl':  'тагальский',
  'ta':  'тамильский',
  'tt':  'татарский',
  'te':  'телугу',
  'tr':  'турецкий',
  'udm': 'удмуртский',
  'uz':  'узбекский',
  'uk':  'украинский',
  'ur':  'урду',
  'fi':  'финский',
  'fr':  'французский',
  'hi':  'хинди',
  'hr':  'хорватский',
  'cs':  'чешский',
  'sv':  'шведский',

  // Unsupported by Dialogflow
  //'gd': 'шотландский',

  'et': 'эстонский',
  'eo': 'эсперанто',
  'jv': 'яванский',
  'ja': 'японский'
}
